//=============================================================================
//
// エフェクト処理 [effect.h]
// Author : Suzuki Mahiro
//
//=============================================================================

//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "effect.h"
#include "renderer.h"
#include "manager.h"

//*****************************************************************************
//性的メンバ変数宣言
//*****************************************************************************
LPDIRECT3DTEXTURE9 CEffect::m_apTexture[CEffect::TYPE_MAX] = {};

//*****************************************************************************
//コンストラクタ
//*****************************************************************************
CEffect::CEffect(OBJTYPE nPriority) :CAnimation(nPriority)
{
}

//*****************************************************************************
//デストラクタ
//*****************************************************************************
CEffect::~CEffect()
{
}

//*****************************************************************************
//テクスチャの読み込み
//*****************************************************************************
HRESULT CEffect::Load(void)
{
	LPDIRECT3DDEVICE9 pDevice = CManager::GetRenderer()->GetDevice();

	D3DXCreateTextureFromFile(pDevice, "Data/Textures/effect_explosion.png", &m_apTexture[TYPE_EXPLOSION]);
	D3DXCreateTextureFromFile(pDevice, "Data/Textures/effect_explosion_bullet.png", &m_apTexture[TYPE_EXPLOSION_BULLET]);
	D3DXCreateTextureFromFile(pDevice, "Data/Textures/effect_wall_hit.png", &m_apTexture[TYPE_WALL_HIT]);

	return S_OK; 
}

//*****************************************************************************
//テクスチャの破棄
//*****************************************************************************
void CEffect::Unload(void)
{
	for (int nCount = 0; nCount < TYPE_MAX; nCount++)
	{
		if (m_apTexture[nCount] != NULL)
		{
			m_apTexture[nCount]->Release();
			m_apTexture[nCount] = NULL;
		}
	}
}

//*****************************************************************************
//初期化処理
//*****************************************************************************
HRESULT CEffect::Init(void)
{
	//アニメーションの初期化処理
	CAnimation::Init();

	return S_OK;
}

//*****************************************************************************
//終了処理
//*****************************************************************************
void CEffect::Uninit(void)
{
	//アニメーションの終了処理
	CAnimation::Uninit();
}

//*****************************************************************************
//更新処理
//*****************************************************************************
void CEffect::Update(void)
{
	//アニメーションの更新処理
	CAnimation::Update();
}

//*****************************************************************************
//描画処理
//*****************************************************************************
void CEffect::Draw(void)
{
	//アニメーションの描画処理
	CAnimation::Draw();
}