//=============================================================================
//
// 弾と壁の衝突エフェクト処理 [effect_wall_hit.cpp]
// Author : Suzuki Mahiro
//
//=============================================================================

//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "effect_wall_hit.h"
#include "renderer.h"
#include "manager.h"
#include "sound.h"

//*****************************************************************************
//マクロ定義
//*****************************************************************************
#define ANIM_LINE (4)							//アニメーションの行数
#define ANIM_COLUMN (3)							//アニメーションの列数
#define ANIM_SPEED (1)							//アニメーションの切り替え速度
#define SIZE (D3DXVECTOR3(10.0f, 10.0f, 10.0f))	//エフェクトの大きさ

//*****************************************************************************
//コンストラクタ
//*****************************************************************************
CEffectWallHit::CEffectWallHit(OBJTYPE nPriority) :CEffect(nPriority)
{
}

//*****************************************************************************
//デストラクタ
//*****************************************************************************
CEffectWallHit::~CEffectWallHit()
{
}

//*****************************************************************************
//弾と壁の衝突エフェクトの生成
//*****************************************************************************
CEffectWallHit* CEffectWallHit::Create(const D3DXVECTOR3 &pos)
{
	//弾と壁の衝突エフェクトのメモリ確保
	CEffectWallHit *pEffectWallHit = new CEffectWallHit;

	if (pEffectWallHit != nullptr)
	{
		//弾と壁の衝突エフェクト情報の設定
		pEffectWallHit->SetPos(pos);

		//初期化処理
		pEffectWallHit->Init();

		return pEffectWallHit;
	}

	return nullptr;
}

//*****************************************************************************
//初期化処理
//*****************************************************************************
HRESULT CEffectWallHit::Init(void)
{
	//テクスチャの種類の設定
	BindTexture(GetTexture(TYPE_WALL_HIT));

	//テクスチャ情報の設定
	SetTex(ANIM_LINE, ANIM_COLUMN, ANIM_SPEED);

	//リピート設定
	SetRepeat(REP_UNREPEAT);

	//サイズの設定
	SetSize(SIZE);

	//エフェクトの初期化処理
	CEffect::Init();

	//サウンドの再生
	CManager::GetSound()->PlaySound(CSound::SOUND_LABEL_WALL_HIT);

	return S_OK;
}

//*****************************************************************************
//終了処理
//*****************************************************************************
void CEffectWallHit::Uninit(void)
{
	//エフェクトの終了処理
	CEffect::Uninit();
}

//*****************************************************************************
//更新処理
//*****************************************************************************
void CEffectWallHit::Update(void)
{
	//エフェクトの更新処理
	CEffect::Update();
}

//*****************************************************************************
//描画処理
//*****************************************************************************
void CEffectWallHit::Draw(void)
{
	//エフェクトの描画処理
	CEffect::Draw();
}