//=============================================================================
//
// 床データ管理 [floorData.h]
// Author : Suzuki Mahiro
//
//=============================================================================
#ifndef _FLOOR_DATA_H_
#define _FLOOR_DATA_H_

//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define FLOOR_MAX (32)	//床の最大数

//*****************************************************************************
//クラス定義
//*****************************************************************************
class CFloorData
{
public:
	//壁情報の構造体
	struct CreateInfo
	{
		D3DXVECTOR3 pos;	//位置
		D3DXVECTOR3 size;	//大きさ
		D3DXVECTOR3 rot;	//角度
	};

	CFloorData();	//コンストラクタ
	~CFloorData();	//デストラクタ

	HRESULT Init(void);	//初期化処理
	void Uninit(void);	//終了処理

	CreateInfo* GetCreateInfo(const int &nCount) { return &m_aCreateInfo[nCount]; }	//生成情報の取得
	int GetCreateNum(void) { return m_nCreateNum; }									//生成順の取得

private:
	CreateInfo m_aCreateInfo[FLOOR_MAX];	//生成情報
	int m_nCreateNum;						//生成順のカウント＆生成数用
};

#endif