//=============================================================================
//
// ゲーム処理 [game.h]
// Author : Suzuki Mahiro
//
//=============================================================================
#ifndef _GAME_H_
#define _GAME_H_

//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "mode.h"
#include "character.h"

//*****************************************************************************
//前方宣言
//*****************************************************************************
class CPlayer;

//*****************************************************************************
//クラス定義
//*****************************************************************************
class CGame :public CMode
{
public:
	CGame();	//コンストラクタ
	~CGame();	//デストラクタ

	HRESULT Init(void);	//初期化処理
	void Uninit(void);	//終了処理
	void Update(void);	//更新処理

	static void SetLoser(const CCharacter::TYPE &loser);	//敗者判定の設定

	static CPlayer* GetPlayer(const CCharacter::TYPE &type);	//プレイヤーポインタの取得

private:
	static CCharacter::TYPE m_loser;					//敗者判定用変数
	static CPlayer* m_apPlayer[CCharacter::TYPE_MAX];	//プレイヤーポインタ
};
#endif