//=============================================================================
//
// ライト処理 [light.h]
// Author : Suzuki Mahiro
//
//=============================================================================
#ifndef _LIGHT_H_
#define _LIGHT_H_

//*****************************************************************************
//クラス宣言
//*****************************************************************************
class CLight
{
public:
	CLight();			//コンストラクタ
	~CLight();			//デストラクタ
	void Init(void);	//初期化処理
	void Uninit(void);	//終了処理

private:
	D3DLIGHT9 m_light;	//ライト情報
};


#endif