//=============================================================================
//
// UI処理 [ui.cpp]
// Author : Suzuki Mahiro
//
//=============================================================================

//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "ui.h"
#include "renderer.h"
#include "manager.h"

//*****************************************************************************
//静的メンバ変数宣言
//*****************************************************************************
LPDIRECT3DTEXTURE9 CUi::m_apTexture[TYPE_MAX] = {};

//*****************************************************************************
//コンストラクタ
//*****************************************************************************
CUi::CUi(OBJTYPE nPriority) :CScene2D(nPriority)
{
	m_type = TYPE_NONE;
}

//*****************************************************************************
//デストラクタ
//*****************************************************************************
CUi::~CUi()
{
}

//*****************************************************************************
//ロード処理
//*****************************************************************************
HRESULT CUi::Load(void)
{
	LPDIRECT3DDEVICE9 pDevice = CManager::GetRenderer()->GetDevice();

	// テクスチャの読み込み
	D3DXCreateTextureFromFile(pDevice, "Data/Textures/title.jpg", &m_apTexture[TYPE_TITLE]);
	D3DXCreateTextureFromFile(pDevice, "Data/Textures/result.jpg", &m_apTexture[TYPE_RESULT]);
	D3DXCreateTextureFromFile(pDevice, "Data/Textures/start.png", &m_apTexture[TYPE_START]);
	D3DXCreateTextureFromFile(pDevice, "Data/Textures/win_player_1.png", &m_apTexture[TYPE_WIN_PLAYER_1]);
	D3DXCreateTextureFromFile(pDevice, "Data/Textures/win_player_2.png", &m_apTexture[TYPE_WIN_PLAYER_2]);
	D3DXCreateTextureFromFile(pDevice, "Data/Textures/draw.png", &m_apTexture[TYPE_DRAW]);

	return S_OK;
}

//*****************************************************************************
//アンロード処理
//*****************************************************************************
void CUi::Unload(void)
{
	for (int nCount = 0; nCount < TYPE_MAX; nCount++)
	{
		if (m_apTexture[nCount] != NULL)
		{
			// テクスチャの破棄
			m_apTexture[nCount]->Release();
			m_apTexture[nCount] = NULL;
		}
	}
}

//*****************************************************************************
//初期化処理
//*****************************************************************************
HRESULT CUi::Init(void)
{
	//シーン2Dの初期化
	CScene2D::Init();

	return S_OK;
}

//*****************************************************************************
//終了処理
//*****************************************************************************
void CUi::Uninit(void)
{
	//シーン2Dの終了処理
	CScene2D::Uninit();
}

//*****************************************************************************
//更新処理
//*****************************************************************************
void CUi::Update(void)
{
	//シーン2Dの更新処理
	CScene2D::Update();
}

//*****************************************************************************
//描画処理
//*****************************************************************************
void CUi::Draw(void)
{
	//シーン2Dの描画処理
	CScene2D::Draw();
}