//=============================================================================
//
// 引き分けUI処理 [ui_draw.cpp]
// Author : Suzuki Mahiro
//
//=============================================================================

//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "ui_draw.h"
#include "renderer.h"
#include "manager.h"
#include "sound.h"

//*****************************************************************************
//コンストラクタ
//*****************************************************************************
CUiDraw::CUiDraw(OBJTYPE nPriority) :CUi(nPriority)
{
	m_nCntUi = 0;
}

//*****************************************************************************
//デストラクタ
//*****************************************************************************
CUiDraw::~CUiDraw()
{
}

//*****************************************************************************
//引き分け勝利UIの生成
//*****************************************************************************
CUiDraw* CUiDraw::Create(const D3DXVECTOR3 &pos, const D3DXVECTOR3 &size)
{
	//引き分けUIのメモリ確保
	CUiDraw *pUiDraw = new CUiDraw;

	if (pUiDraw != nullptr)
	{
		//引き分けUI情報の設定
		pUiDraw->SetPos(pos);
		pUiDraw->SetSize(size);

		//初期化処理
		pUiDraw->Init();

		return pUiDraw;
	}

	return nullptr;
}

//*****************************************************************************
//初期化処理
//*****************************************************************************
HRESULT CUiDraw::Init(void)
{
	//指定したOBJTYPEのみを更新する
	SetUpdateType(OBJTYPE_UI_DRAW, OBJTYPE_EFFECT_EXPLOSION, NULL);

	//テクスチャの設定
	BindTexture(GetTexture(TYPE_DRAW));

	//UIの初期化処理
	CUi::Init();

	//サウンドの再生
	CManager::GetSound()->PlaySound(CSound::SOUND_LABEL_FINISH);

	return S_OK;
}

//*****************************************************************************
//終了処理
//*****************************************************************************
void CUiDraw::Uninit(void)
{
	//UIの終了処理
	CUi::Uninit();
}

//*****************************************************************************
//更新処理
//*****************************************************************************
void CUiDraw::Update(void)
{
	//カウントを進める
	m_nCntUi++;

	if (m_nCntUi >= INIT_FINISH_UI_TIME)
	{ //カウントが規定値を超えたとき
	  //フェードの生成
		CManager::CreateFade(CManager::MODE_TITLE);
	}

	//UIの更新処理
	CUi::Update();
}

//*****************************************************************************
//描画処理
//*****************************************************************************
void CUiDraw::Draw(void)
{
	//UIの描画処理
	CUi::Draw();
}