//=============================================================================
//
// タイトルUI処理 [ui_title.h]
// Author : Suzuki Mahiro
//
//=============================================================================
#ifndef _UI_TITLE_H_
#define _UI_TITLE_H_

//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "ui.h"

//*****************************************************************************
//クラス定義
//*****************************************************************************
class CUiTitle :public CUi
{
public:
	CUiTitle(OBJTYPE nPriority = CScene::OBJTYPE_UI_TITLE);	//コンストラクタ
	~CUiTitle();											//デストラクタ

	static CUiTitle *Create(const D3DXVECTOR3 &pos, const D3DXVECTOR3 &size);	//生成処理

	HRESULT Init(void);	//初期化処理
	void Uninit(void);	//終了処理
	void Update(void);	//更新処理
	void Draw(void);	//描画処理
};

#endif