//=============================================================================
//
// プレイヤー１の勝利UI処理 [ui_win_player1.cpp]
// Author : Suzuki Mahiro
//
//=============================================================================

//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "ui_win_player1.h"
#include "renderer.h"
#include "manager.h"
#include "sound.h"

//*****************************************************************************
//コンストラクタ
//*****************************************************************************
CUiWinPlayer1::CUiWinPlayer1(OBJTYPE nPriority) :CUi(nPriority)
{
	m_nCntUi = 0;
}

//*****************************************************************************
//デストラクタ
//*****************************************************************************
CUiWinPlayer1::~CUiWinPlayer1()
{
}

//*****************************************************************************
//プレイヤー１勝利UIの生成
//*****************************************************************************
CUiWinPlayer1* CUiWinPlayer1::Create(const D3DXVECTOR3 &pos, const D3DXVECTOR3 &size)
{
	//プレイヤー１勝利UIのメモリ確保
	CUiWinPlayer1 *pUiWinPlayer1 = new CUiWinPlayer1;

	if (pUiWinPlayer1 != nullptr)
	{
		//プレイヤー１勝利UI情報の設定
		pUiWinPlayer1->SetPos(pos);
		pUiWinPlayer1->SetSize(size);

		//初期化処理
		pUiWinPlayer1->Init();

		return pUiWinPlayer1;
	}

	return nullptr;
}

//*****************************************************************************
//初期化処理
//*****************************************************************************
HRESULT CUiWinPlayer1::Init(void)
{
	//指定したOBJTYPEのみを更新する
	SetUpdateType(OBJTYPE_UI_WIN_PLAYER_1, OBJTYPE_EFFECT_EXPLOSION, NULL);

	//テクスチャの設定
	BindTexture(GetTexture(TYPE_WIN_PLAYER_1));

	//UIの初期化処理
	CUi::Init();

	//サウンドの再生
	CManager::GetSound()->PlaySound(CSound::SOUND_LABEL_FINISH);

	return S_OK;
}

//*****************************************************************************
//終了処理
//*****************************************************************************
void CUiWinPlayer1::Uninit(void)
{
	//UIの終了処理
	CUi::Uninit();
}

//*****************************************************************************
//更新処理
//*****************************************************************************
void CUiWinPlayer1::Update(void)
{
	//カウントを進める
	m_nCntUi++;

	if (m_nCntUi >= INIT_FINISH_UI_TIME)
	{ //カウントが規定値を超えたとき
		//フェードの生成
		CManager::CreateFade(CManager::MODE_TITLE);
	}

	//UIの更新処理
	CUi::Update();
}

//*****************************************************************************
//描画処理
//*****************************************************************************
void CUiWinPlayer1::Draw(void)
{
	//UIの描画処理
	CUi::Draw();
}